# Pandas dataframes

Pandas dataframes are mutable two-dimensional structures of data with labeled axes where: 
* each row represents a different observation
* each column represents a different variable

In Python, to define a dataframe, we first need to import the pandas module.

In [ ]:
import pandas as pd

Next, if we want a dataframe with 5 rows and 2 columns, we can do it from a [dictionary](https://www.w3schools.com/python/python_dictionaries.asp), a [list](https://www.w3schools.com/python/python_lists.asp) of lists, a list of dictionaries, etc.

We are going to create a 5 row, 2 column dataframe from a dictionary. To do this, we will follow these steps:

1. Create a dictionary where the keys will be the names of the columns and the values will be lists, with as many elements as the number of rows we want.
2. Convert that dictionary to dataframe with pandas' DataFrame() function

In [2]:
# 1. Create the dictionary
data = {
    "x":[1, 2, 3, 4, 5], 
    "y":[6, 7, 8, 9, 10],
    "z":['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday']
}

In [3]:
data['x']

[1, 2, 3, 4, 5]

In [4]:
# 2. Convert dictionary to dataframe
df = pd.DataFrame(data)
print(df)
# df

   x   y          z
0  1   6     Monday
1  2   7    Tuesday
2  3   8  Wednesday
3  4   9   Thursday
4  5  10     Friday

As we said, we have created a dataframe with 5 rows and two columns, called x and y respectively.

**Observation**: As a result of `print()`, we have not only obtained the 5 rows and 2 columns, but there is an additional "column" of 5 numbers ordered vertically from 0 to 4. This column is called the **index** and it is simply the name of each row, which by default is their ordinal position: 0 indicates the first row; the 1, the second; and so on.

## Import a csv file to dataframe

Most of the time, you will not be creating dataframes yourself, but importing (or "reading") data from a csv file or a database into a pandas dataframe. It's easy to do with pandas' read functions:

In [24]:
# use contextual help to show all the parameters inside read_csv
df = pd.read_csv(r'C:\Users\Anja Wittler\OneDrive\Dokumente\TG\WBS\bootcamp\Sec_3_Pandas\orderlines.csv')

In [25]:
df

,id,id_order,product_id,product_quantity,sku,unit_price,date
0,1119109,299539,0,1,OTT0133,18.99,2017-01-01 00:07:19
1,1119110,299540,0,1,LGE0043,399.00,2017-01-01 00:19:45
2,1119111,299541,0,1,PAR0071,474.05,2017-01-01 00:20:57
3,1119112,299542,0,1,WDT0315,68.39,2017-01-01 00:51:40
4,1119113,299543,0,1,JBL0104,23.74,2017-01-01 01:06:38
...,...,...,...,...,...,...,...
293978,1650199,527398,0,1,JBL0122,42.99,2018-03-14 13:57:25
293979,1650200,527399,0,1,PAC0653,141.58,2018-03-14 13:57:34
293980,1650201,527400,0,2,APP0698,9.99,2018-03-14 13:57:41
293981,1650202,527388,0,1,BEZ0204,19.99,2018-03-14 13:58:01
293982,1650203,527401,0,1,APP0927,13.99,2018-03-14 13:58:36

## Dataframe dimensions

With the `.shape` [method](https://www.w3schools.com/python/gloss_python_object_methods.asp) we can calculate the dimensions (number of rows and columns) of the dataframe.

In [7]:
df.shape

(293983, 7)

As a result we obtain a [tuple](https://www.w3schools.com/python/python_tuples.asp) where the first element is the number of rows, which in our case is 293983, while the second element is the number of columns, which in our example was 7.

In [8]:
nrows = df.shape[0]
ncols = df.shape[1]
print("The number of rows is", nrows)
print("The number of columns is", ncols)

The number of rows is 293983
The number of columns is 7

`DataFrame.size` returns the total number of values that the dataframe has (number of rows per number of columns):

In [9]:
df.size

2057881

In [10]:
# check if that's true
df.shape[0] * df.shape[1] == df.size

True

With the `.ndim` method we calculate the number of dimensions that the dataframe has. This will always be 2, as it consists of rows and columns.

In [11]:
df.ndim

2

## Dataframes exploration

The `DataFrame.head()` and `DataFrame.tail()` methods are used to display the first or last rows of the dataframe. Looking at the raw data is a great way to get a grasp of what's in there. By default, 5 rows will be shown, but you can change that:

In [12]:
df.head()

,id,id_order,product_id,product_quantity,sku,unit_price,date
0,1119109,299539,0,1,OTT0133,18.99,2017-01-01 00:07:19
1,1119110,299540,0,1,LGE0043,399.00,2017-01-01 00:19:45
2,1119111,299541,0,1,PAR0071,474.05,2017-01-01 00:20:57
3,1119112,299542,0,1,WDT0315,68.39,2017-01-01 00:51:40
4,1119113,299543,0,1,JBL0104,23.74,2017-01-01 01:06:38

In [13]:
df.head(9)

,id,id_order,product_id,product_quantity,sku,unit_price,date
0,1119109,299539,0,1,OTT0133,18.99,2017-01-01 00:07:19
1,1119110,299540,0,1,LGE0043,399.00,2017-01-01 00:19:45
2,1119111,299541,0,1,PAR0071,474.05,2017-01-01 00:20:57
3,1119112,299542,0,1,WDT0315,68.39,2017-01-01 00:51:40
4,1119113,299543,0,1,JBL0104,23.74,2017-01-01 01:06:38
5,1119114,295310,0,10,WDT0249,231.79,2017-01-01 01:14:27
6,1119115,299544,0,1,APP1582,1.137.99,2017-01-01 01:17:21
7,1119116,299545,0,1,OWC0100,47.49,2017-01-01 01:46:16
8,1119119,299546,0,1,IOT0014,18.99,2017-01-01 01:50:34

In [14]:
df.tail()

,id,id_order,product_id,product_quantity,sku,unit_price,date
293978,1650199,527398,0,1,JBL0122,42.99,2018-03-14 13:57:25
293979,1650200,527399,0,1,PAC0653,141.58,2018-03-14 13:57:34
293980,1650201,527400,0,2,APP0698,9.99,2018-03-14 13:57:41
293981,1650202,527388,0,1,BEZ0204,19.99,2018-03-14 13:58:01
293982,1650203,527401,0,1,APP0927,13.99,2018-03-14 13:58:36

The methods `DataFrame.info()`, `DataFrame.describe()` and `DataFrame.nunique()` give a general overview of what's in the dataframe:

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 293983 entries, 0 to 293982
Data columns (total 7 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   id                293983 non-null  int64
 1   id_order          293983 non-null  int64
 2   product_id        293983 non-null  int64
 3   product_quantity  293983 non-null  int64
 4   sku               293983 non-null  object
 5   unit_price        293983 non-null  object
 6   date              293983 non-null  object
dtypes: int64(4), object(3)
memory usage: 15.7+ MB

In [16]:
df.describe()

                 id       id_order  product_id  product_quantity
count  2.939830e+05  293983.000000    293983.0     293983.000000
mean   1.397918e+06  419999.116544         0.0          1.121126
std    1.530096e+05   66344.486479         0.0          3.396569
min    1.119109e+06  241319.000000         0.0          1.000000
25%    1.262542e+06  362258.500000         0.0          1.000000
50%    1.406940e+06  425956.000000         0.0          1.000000
75%    1.531322e+06  478657.000000         0.0          1.000000
max    1.650203e+06  527401.000000         0.0        999.000000

In [17]:
df.nunique()

id                  293983
id_order            204855
product_id               1
product_quantity        67
sku                   7951
unit_price           11329
date                251631
dtype: int64

The `.unique()` method returns the unique values from a column as a numpy array, which can be indexed with `[]`:

In [18]:
df['sku'].unique()[:10]

array(['OTT0133', 'LGE0043', 'PAR0071', 'WDT0315', 'JBL0104', 'WDT0249',
       'APP1582', 'OWC0100', 'IOT0014', 'APP0700'], dtype=object)

The `isna()` method returns a boolean for each value: `True` if that value is "missing" (which is represented as `NaN` in numpy and pandas) and `False` if the value is not missing:

In [19]:
df.isna()

,id,id_order,product_id,product_quantity,sku,unit_price,date
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...
293978,False,False,False,False,False,False,False
293979,False,False,False,False,False,False,False
293980,False,False,False,False,False,False,False
293981,False,False,False,False,False,False,False
293982,False,False,False,False,False,False,False

We can then use `DataFrame.sum()` to add up all these booleans for each column, and count how many missing values are there in the dataframe, since `True` is interpreted as `1` and `False` as `0`:

In [20]:
df.isna().sum()

id                  0
id_order            0
product_id          0
product_quantity    0
sku                 0
unit_price          0
date                0
dtype: int64

`DataFrame.duplicated()` also returns a boolean output, but in this case just one value per row: `Ture` if that row is duplicated and `False` if it's not. Again, using `sum()` allows us to count how many `True` values (i.e. duplicated rows) are there in total:

In [21]:
df.duplicated().sum() # parameters keep=False
# df.drop_duplicates()

0

In [33]:
df['unit_price_new'] = pd.to_numeric(df['unit_price'], errors='coerce')

`DataFrame.nlargest(n, columns)` will return the top `n` rows with the largest value for whatever column we specify in `columns`. Below, we see the rows with the largest product quantity values:

In [26]:
df.nlargest(5, 'product_quantity')

,id,id_order,product_id,product_quantity,sku,unit_price,date
53860,1228150,346221,0,999,APP1190,55.99,2017-04-14 21:50:52
68712,1254032,358747,0,999,SEV0028,19.99,2017-05-24 14:51:58
57796,1234924,349475,0,800,KIN0137,7.49,2017-04-25 09:59:00
57306,1234111,349133,0,555,APP0665,70.99,2017-04-24 10:20:13
40813,1204788,335057,0,201,THU0029,80.99,2017-03-14 15:25:53

 `DataFrame.nsmallest()` does the same, for the smallest values:

In [34]:
df.where(df.sku != 'LIBRO').nsmallest(5, 'unit_price_new')

,id,id_order,product_id,product_quantity,sku,unit_price,date,unit_price_new
77008,1268645.0,365886.0,0.0,1.0,APP1465,-119.00,2017-06-15 12:48:54,-119.0
53515,1227566.0,345934.0,0.0,1.0,KIN0153-2,0.00,2017-04-13 13:47:21,0.0
53530,1227590.0,345957.0,0.0,1.0,WDT0347,0.00,2017-04-13 14:44:05,0.0
70545,1257388.0,360246.0,0.0,1.0,ENV0496,0.00,2017-05-29 16:21:58,0.0
71694,1259481.0,361198.0,0.0,1.0,ENV0505,0.00,2017-06-01 12:41:19,0.0

In [ ]:
df['unit_price_new'] = pd.to_numeric(df['unit_price'], errors='raise')

In [ ]:
df['unit_price_new'].isna().sum()

In [ ]:
df.describe()

## Columns

Given a dataframe, we can select a particular column in several ways:

* Indicating the name of the column between square brackets, `[]`
* With the `.loc[]` method (by name or tag)
* With the `.iloc[]` method (by position)

The simple `[]` method is used to just view a column if you now its name and **don't want to modify it**:

In [ ]:
# select the column by name
df['id_order']

The `.loc[]` takes two arguments: `[rows, columns]`. Passing `:` in the rows argument means "grabbing all the rows", which allows you to select a whole column if you know its name. This method is more flexible as you will see in the future, and would allow you to modify the data if needed.

In [ ]:
# method .loc[]
df.loc[:, 'id_order']

In [27]:
df.loc[:, ['id_order', 'sku']]

        id_order      sku
0         299539  OTT0133
1         299540  LGE0043
2         299541  PAR0071
3         299542  WDT0315
4         299543  JBL0104
...          ...      ...
293978    527398  JBL0122
293979    527399  PAC0653
293980    527400  APP0698
293981    527388  BEZ0204
293982    527401  APP0927

[293983 rows x 2 columns]

The `iloc[]` method works similarly, but only accept integers (which represent the positions of the rows and columns):

In [50]:
# method .iloc[]
print(df.iloc[:, 0])

0         1119109
1         1119110
2         1119111
3         1119112
4         1119113
           ...
293978    1650199
293979    1650200
293980    1650201
293981    1650202
293982    1650203
Name: id, Length: 293983, dtype: int64

### Select multiple columns

If we wanted to select more than one column, we could do it with all the options listed above, with slight modifications in some cases:

In [ ]:
# note that we pass a list inside of the []
df[['id_order','sku']]

In [ ]:
# .loc()
df.loc[:, ["id_order", "sku"]]

With `.loc[]` and `:` you can select all columns between two columns you specify.

In [28]:
# .loc()
df.loc[:, "id_order":"sku"]

        id_order  product_id  product_quantity      sku
0         299539           0                 1  OTT0133
1         299540           0                 1  LGE0043
2         299541           0                 1  PAR0071
3         299542           0                 1  WDT0315
4         299543           0                 1  JBL0104
...          ...         ...               ...      ...
293978    527398           0                 1  JBL0122
293979    527399           0                 1  PAC0653
293980    527400           0                 2  APP0698
293981    527388           0                 1  BEZ0204
293982    527401           0                 1  APP0927

[293983 rows x 4 columns]

In [29]:
# .iloc
df.iloc[:, [0, 1]]

             id  id_order
0       1119109    299539
1       1119110    299540
2       1119111    299541
3       1119112    299542
4       1119113    299543
...         ...       ...
293978  1650199    527398
293979  1650200    527399
293980  1650201    527400
293981  1650202    527388
293982  1650203    527401

[293983 rows x 2 columns]

In [30]:
df.iloc[:, 0:2]

             id  id_order
0       1119109    299539
1       1119110    299540
2       1119111    299541
3       1119112    299542
4       1119113    299543
...         ...       ...
293978  1650199    527398
293979  1650200    527399
293980  1650201    527400
293981  1650202    527388
293982  1650203    527401

[293983 rows x 2 columns]

## Rows

Given a dataframe, we can select a particular row in several ways:

* With the `.loc[]` method (by name or tag)
* With the `.iloc[]` method (by position)

Selecting a single row returns a Pandas Series (the 1-dimensional object that pandas has):

In [35]:
df.loc[0]

id                              1119109
id_order                         299539
product_id                            0
product_quantity                      1
sku                             OTT0133
unit_price                        18.99
date                2017-01-01 00:07:19
unit_price_new                    18.99
Name: 0, dtype: object

With `.loc[]`, rows are selected by its index name:

In [36]:
df.loc[0:3]

,id,id_order,product_id,product_quantity,sku,unit_price,date,unit_price_new
0,1119109,299539,0,1,OTT0133,18.99,2017-01-01 00:07:19,18.99
1,1119110,299540,0,1,LGE0043,399.00,2017-01-01 00:19:45,399.00
2,1119111,299541,0,1,PAR0071,474.05,2017-01-01 00:20:57,474.05
3,1119112,299542,0,1,WDT0315,68.39,2017-01-01 00:51:40,68.39

If we change the index and set it to the `id` column, now the first rows can not be selected the same way:

In [37]:
df.set_index('id', inplace=True)
# inplace = True is the same as doing df = df.set_index('id'), i.e. it modifies the dataframe

In [38]:
df.loc[0:3]

Empty DataFrame
Columns: [id_order, product_id, product_quantity, sku, unit_price, date, unit_price_new]
Index: []

In [39]:
df.head(2)

,id_order,product_id,product_quantity,sku,unit_price,date,unit_price_new
id,,,,,,,
1119109,299539,0,1,OTT0133,18.99,2017-01-01 00:07:19,18.99
1119110,299540,0,1,LGE0043,399.00,2017-01-01 00:19:45,399.00

In [40]:
# select the first observation with the .loc() method
df.loc[1119110]

id_order                         299540
product_id                            0
product_quantity                      1
sku                             LGE0043
unit_price                       399.00
date                2017-01-01 00:19:45
unit_price_new                    399.0
Name: 1119110, dtype: object

With the `iloc[]` method we don't need to know the row names to select rows at a certain position:

In [41]:
df.iloc[0:3]

,id_order,product_id,product_quantity,sku,unit_price,date,unit_price_new
id,,,,,,,
1119109,299539,0,1,OTT0133,18.99,2017-01-01 00:07:19,18.99
1119110,299540,0,1,LGE0043,399.00,2017-01-01 00:19:45,399.00
1119111,299541,0,1,PAR0071,474.05,2017-01-01 00:20:57,474.05

In [42]:
# select the last observation with the method .iloc[]
df.iloc[-1]
# df.tail(1)

id_order                         527401
product_id                            0
product_quantity                      1
sku                             APP0927
unit_price                        13.99
date                2018-03-14 13:58:36
unit_price_new                    13.99
Name: 1650203, dtype: object

In [43]:
df.loc[[1119111,1119112,1119113]]

,id_order,product_id,product_quantity,sku,unit_price,date,unit_price_new
id,,,,,,,
1119111,299541,0,1,PAR0071,474.05,2017-01-01 00:20:57,474.05
1119112,299542,0,1,WDT0315,68.39,2017-01-01 00:51:40,68.39
1119113,299543,0,1,JBL0104,23.74,2017-01-01 01:06:38,23.74

Again, using `:` you can select all elements between the two that you specified:

In [44]:
df.loc[1119111:1119113]

,id_order,product_id,product_quantity,sku,unit_price,date,unit_price_new
id,,,,,,,
1119111,299541,0,1,PAR0071,474.05,2017-01-01 00:20:57,474.05
1119112,299542,0,1,WDT0315,68.39,2017-01-01 00:51:40,68.39
1119113,299543,0,1,JBL0104,23.74,2017-01-01 01:06:38,23.74

In [46]:
df.reset_index()

,index,id,id_order,product_id,product_quantity,sku,unit_price,date,unit_price_new
0,0,1119109,299539,0,1,OTT0133,18.99,2017-01-01 00:07:19,18.99
1,1,1119110,299540,0,1,LGE0043,399.00,2017-01-01 00:19:45,399.00
2,2,1119111,299541,0,1,PAR0071,474.05,2017-01-01 00:20:57,474.05
3,3,1119112,299542,0,1,WDT0315,68.39,2017-01-01 00:51:40,68.39
4,4,1119113,299543,0,1,JBL0104,23.74,2017-01-01 01:06:38,23.74
...,...,...,...,...,...,...,...,...,...
293978,293978,1650199,527398,0,1,JBL0122,42.99,2018-03-14 13:57:25,42.99
293979,293979,1650200,527399,0,1,PAC0653,141.58,2018-03-14 13:57:34,141.58
293980,293980,1650201,527400,0,2,APP0698,9.99,2018-03-14 13:57:41,9.99
293981,293981,1650202,527388,0,1,BEZ0204,19.99,2018-03-14 13:58:01,19.99
293982,293982,1650203,527401,0,1,APP0927,13.99,2018-03-14 13:58:36,13.99

Indexing can get tricky sometimes, it's ok to take some time to get used to the methods we presented, and it's ok to have some trouble selecting the rows and columns you need. For an exhaustive guide on Pandas indexing, check out this link: https://pandas.pydata.org/docs/user_guide/indexing.html#indexing

## Drop and Filter data

The `.drop()` method allows us to delete the rows or columns that we indicate.

**Note:** Again, if we want to directly apply the changes to the original dataframe, we need to indicate `inplace = True`. Otherwise, we are getting as an output just a "view" of how the dataframe looks like after the drop, but the original dataframe remains untouched.

In [ ]:
# droping the column "unit_price"
# axis=1 means we want to drop a column, not a row (for rows, axis=0)
df.drop(['unit_price'], axis=1)

How to filter information on a dataframe.

In [ ]:
# rows with product quantity larger than 100
df[df['product_quantity'] > 100]

The `.query()` method can be useful for this purpose, as it resembles SQL syntax. Note that it works only when the column values do not contain blank spaces. You can use any **Python Comparison Operators** you want inside the query method (find more information on this [link](https://www.w3schools.com/python/python_operators.asp)).

In [ ]:
df.query('product_quantity > 100')

The `isin()` method is very useful to find rows that match any of the values you have in a list. For example, here we are searching for rows where its `sku` matches any of the 2 sku's we listed:

In [ ]:
# find out a column that contains a list
df['sku'].isin(['JBL0104', 'ADN0039'])

This expression can be used inside of `[]` or `.loc[]` to filter the rows that have a `True` value. This is called "boolean indexing" and it is really useful:

In [47]:
only_valid_skus = df['sku'].isin(['JBL0104', 'ADN0039', 'LIBRO'])
df.loc[only_valid_skus, :]

,id,id_order,product_id,product_quantity,sku,unit_price,date,unit_price_new
4,1119113,299543,0,1,JBL0104,23.74,2017-01-01 01:06:38,23.74
716,1120463,300212,0,2,JBL0104,26.99,2017-01-02 01:44:05,26.99
774,1120607,300272,0,1,JBL0104,24.99,2017-01-02 08:57:07,24.99
866,1120758,300349,0,1,JBL0104,24.99,2017-01-02 10:41:29,24.99
1411,1122014,300851,0,1,JBL0104,24.99,2017-01-02 18:50:13,24.99
...,...,...,...,...,...,...,...,...
258180,1593360,503247,0,1,JBL0104,23.99,2018-01-31 20:55:50,23.99
263790,1601885,506553,0,1,JBL0104,24.99,2018-02-05 22:41:40,24.99
266635,1606326,508345,0,2,JBL0104,24.99,2018-02-08 19:20:21,24.99
268446,1608949,509377,0,1,JBL0104,24.99,2018-02-10 18:02:37,24.99
279801,1628218,517916,0,1,JBL0104,27.99,2018-02-26 20:51:30,27.99

In [49]:
# boolean mask created, only 'True''s are shown with .loc
only_valid_skus.value_counts()

False    293623
True        360
Name: sku, dtype: int64

Pandas compresses large outputs in Jupyter Notebooks. If you want to see more rows, you can change the options:

In [ ]:
pd.options.display.max_rows = 100
# after running this cell, run the code above again and you will see all the rows.

For a complete list of all settings and options that can be tweaked, check out this: https://pandas.pydata.org/pandas-docs/stable/user_guide/options.html

#### Modifying a dataframe & the `.copy()` method

Let's take a small chunk of data from our dataframe:

In [51]:
sample = df.iloc[:3,:]
sample

,id,id_order,product_id,product_quantity,sku,unit_price,date,unit_price_new
0,1119109,299539,0,1,OTT0133,18.99,2017-01-01 00:07:19,18.99
1,1119110,299540,0,1,LGE0043,399.00,2017-01-01 00:19:45,399.00
2,1119111,299541,0,1,PAR0071,474.05,2017-01-01 00:20:57,474.05

Now we pick a single cell from the sample we took and we assign a new value to it. A warning already tells us that this is a risky thing to do:

In [52]:
# we change the "unit_price" of the first row:
sample.iloc[0,4] = 'NEW VALUE HERE'

C:\Users\Anja Wittler\anaconda3\lib\site-packages\pandas\core\indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

We can see the new value on the `sample` we took:

In [53]:
sample

,id,id_order,product_id,product_quantity,sku,unit_price,date,unit_price_new
0,1119109,299539,0,1,NEW VALUE HERE,18.99,2017-01-01 00:07:19,18.99
1,1119110,299540,0,1,LGE0043,399.00,2017-01-01 00:19:45,399.00
2,1119111,299541,0,1,PAR0071,474.05,2017-01-01 00:20:57,474.05

..and, maybe to your surprise, we can see that the new value is also present on the original `df`!

In [54]:
df.head()

,id,id_order,product_id,product_quantity,sku,unit_price,date,unit_price_new
0,1119109,299539,0,1,NEW VALUE HERE,18.99,2017-01-01 00:07:19,18.99
1,1119110,299540,0,1,LGE0043,399.00,2017-01-01 00:19:45,399.00
2,1119111,299541,0,1,PAR0071,474.05,2017-01-01 00:20:57,474.05
3,1119112,299542,0,1,WDT0315,68.39,2017-01-01 00:51:40,68.39
4,1119113,299543,0,1,JBL0104,23.74,2017-01-01 01:06:38,23.74

When you take a chunk of data using `.loc[]` or `iloc[]` and assign it to a new object, the new object is just a "tag" pointing to the very same data as the original dataframe points to. We can avoid this using the method `.copy()`

In [56]:
df = pd.read_csv(r'C:\Users\Anja Wittler\OneDrive\Dokumente\TG\WBS\bootcamp\Sec_3_Pandas\orderlines.csv')
sample = df.iloc[:3,:].copy()
sample.iloc[0,4] = 'NEW VALUE HERE'
sample

,id,id_order,product_id,product_quantity,sku,unit_price,date
0,1119109,299539,0,1,NEW VALUE HERE,18.99,2017-01-01 00:07:19
1,1119110,299540,0,1,LGE0043,399.00,2017-01-01 00:19:45
2,1119111,299541,0,1,PAR0071,474.05,2017-01-01 00:20:57

In [57]:
df.head(3)

,id,id_order,product_id,product_quantity,sku,unit_price,date
0,1119109,299539,0,1,OTT0133,18.99,2017-01-01 00:07:19
1,1119110,299540,0,1,LGE0043,399.00,2017-01-01 00:19:45
2,1119111,299541,0,1,PAR0071,474.05,2017-01-01 00:20:57

As you can see, now it has not been modified.

# CHALLENGES

1. How many different unit prices does the product JBL0104 have? Combine a pandas filter method with the method `.nunique()`.

In [58]:
print(df.where(df.sku == 'JBL0104').nunique())

id                  58
id_order            58
product_id           1
product_quantity     2
sku                  1
unit_price           7
date                58
dtype: int64

In [91]:
# to see how many times each price was used
df.loc[df['sku'].isin(['JBL0104']), :]['unit_price'].value_counts()

24.99    20
23.74    15
23.99     8
26.99     8
22.99     5
22.31     1
27.99     1
Name: unit_price, dtype: int64

In [63]:
only_JBL0104 = df['sku'] == 'JBL0104'
df.loc[only_JBL0104, ['sku', 'unit_price']].unit_price.nunique()

7

2. List the (unique) items that were sold in the order with the id_order 385921.

In [67]:
only_order_385921 = df['id_order'] == 385921
df.loc[only_order_385921, ['id_order', 'sku']].sku.unique()

array(['APP2431', 'APP2348', 'APP2131', 'APP1630', 'APP1735', 'APP1216',
       'APP2092', 'APP1215', 'ELA0017', 'MIN0010', 'ELA0039', 'BEA0046',
       'BOS0034', 'BEA0071', 'ELA0029', 'APP2161', 'HOC0008', 'NOM0026',
       'NOM0014'], dtype=object)

In [71]:
df.loc[only_order_385921, ['id_order', 'sku']]

        id_order      sku
100355    385921  APP2431
100359    385921  APP2348
100360    385921  APP2131
100364    385921  APP1630
100365    385921  APP1735
100366    385921  APP1216
100368    385921  APP2092
100371    385921  APP1215
100374    385921  ELA0017
100379    385921  MIN0010
100384    385921  ELA0039
100386    385921  BEA0046
100387    385921  BOS0034
100390    385921  BEA0071
100391    385921  ELA0029
100392    385921  APP2161
100399    385921  HOC0008
100400    385921  NOM0026
100401    385921  NOM0014

In [99]:
# Hello, here is some code that selects all the skus in id_order==385921, to help in question 2. df.loc[df.id_order==385921, :]['sku']
df.loc[df.id_order==385921, :]['sku'].value_counts()

BOS0034    1
APP2431    1
APP2161    1
ELA0029    1
NOM0026    1
APP1216    1
APP2131    1
APP2348    1
BEA0046    1
APP1215    1
HOC0008    1
BEA0071    1
ELA0039    1
APP1735    1
ELA0017    1
MIN0010    1
NOM0014    1
APP1630    1
APP2092    1
Name: sku, dtype: int64

3. Consider the products with the sku's APP2431 and APP2348. Find out in how many orders were they present.

In [72]:
only_valid_products = df['sku'].isin(['APP2431', 'APP2348'])
df.loc[only_valid_products, :].id_order.nunique()

179

4. Create a new dataframe, `df_50`, with all the rows that have a product quantity higher than 500 and only the columns `id`, id `order`, `product_quantity` and `sku`. Be sure to use the method `.copy()`. Once the new dataframe is created, modify the column 'product_quantity' to 'quantity', and 'sku' to 'product_code'. To do so, you can use the methods `.rename()` or `.columns`.

In [73]:
df.columns

Index(['id', 'id_order', 'product_id', 'product_quantity', 'sku', 'unit_price',
       'date'],
      dtype='object')

In [74]:
#df.loc[:, ["id_order", "sku"]]
df_50 = df.loc[:, ['id', 'id_order', 'product_quantity', 'sku']].copy()

In [75]:
df_50

             id  id_order  product_quantity      sku
0       1119109    299539                 1  OTT0133
1       1119110    299540                 1  LGE0043
2       1119111    299541                 1  PAR0071
3       1119112    299542                 1  WDT0315
4       1119113    299543                 1  JBL0104
...         ...       ...               ...      ...
293978  1650199    527398                 1  JBL0122
293979  1650200    527399                 1  PAC0653
293980  1650201    527400                 2  APP0698
293981  1650202    527388                 1  BEZ0204
293982  1650203    527401                 1  APP0927

[293983 rows x 4 columns]

5. Filter all the order lines where the product `XDO0047` has appeared. Sort the rows by their product quantity using the [`.sort_values()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sort_values.html) from pandas, in a DESCENDING order. Then look at the main descriptive information of this results with the method `.describe()`.

In [85]:
df_50_reduced = df_50.loc[df_50['product_code'] == 'XDO0047', :].quantity.sort_values(ascending=False)

In [86]:
df_50_reduced.describe()

count     36.000000
mean       4.472222
std       20.662576
min        1.000000
25%        1.000000
50%        1.000000
75%        1.000000
max      125.000000
Name: quantity, dtype: float64

OBSERVATION: as you may have noticed, the `unit_price` column is not being detected as a float number on pandas. Some prices have been corrupted. During this week we will discover how to fix them, but for the moment it will be enough to filter the product we would like to analyise, bring the data into a new dataframe and change the data type of the price column to float.

In [90]:
import os
current_path = os.getcwd()
current_path

'C:\\Users\\Anja Wittler\\OneDrive\\Dokumente\\TG\\WBS\\bootcamp\\Sec 2_Python\\pandas\\33dcae23fd3d4c9abe14c6b5aab11f4cpandas-platform-files\\pandas-platform-files'